salara1960/stm32f411/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

// default step
//arm-none-eabi-objcopy -O ihex "${BuildArtifactFileBaseName}.elf" "${BuildArtifactFileBaseName}.hex" && arm-none-eabi-size "${BuildArtifactFileName}"
//
// my step
//arm-none-eabi-objcopy -O ihex "${BuildArtifactFileBaseName}.elf" "${BuildArtifactFileBaseName}.hex" && arm-none-eabi-objcopy -O binary "${BuildArtifactFileBaseName}.elf" "${BuildArtifactFileBaseName}.bin" && ls -la | grep "${BuildArtifactFileBaseName}.*"

/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <malloc.h>

#include "hdr.h"
#include "stm32f4xx_hal_adc.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

#define MAX_TMP_SIZE  256
#define MAX_FIFO_SIZE  64//32
#define MAX_UART_BUF 1024//512
#define MAX_VCC_BUF     8
#define MAX_COMP_BUF    8


#define _1ms 1
#define _2ms 2
#define _3ms 3
#define _4ms 4
#define _5ms 5
#define _10ms (_1ms * 10)
#define _15ms (_1ms * 15)
#define _20ms (_1ms * 20)
#define _30ms (_1ms * 30)
#define _40ms (_1ms * 40)
#define _50ms (_1ms * 50)
#define _100ms (_1ms * 100)
#define _110ms (_1ms * 110)
#define _120ms (_1ms * 120)
#define _125ms (_1ms * 125)
#define _130ms (_1ms * 130)
#define _140ms (_1ms * 140)
#define _150ms (_1ms * 150)
#define _200ms (_1ms * 200)
#define _250ms (_1ms * 250)
#define _300ms (_1ms * 300)
#define _400ms (_1ms * 400)
#define _500ms (_1ms * 500)
#define _600ms (_1ms * 600)
#define _700ms (_1ms * 700)
#define _800ms (_1ms * 800)
#define _900ms (_1ms * 900)
#define _1s (_1ms * 1000)
#define _1s5 (_1ms * 1500)
#define _2s (_1s * 2)//2000
#define _3s (_1s * 3)//3000
#define _4s (_1s * 4)//4000
#define _5s (_1s * 5)//5000
#define _10s (_1s * 10)//10000

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;
DMA_HandleTypeDef hdma_i2c1_rx;
DMA_HandleTypeDef hdma_i2c1_tx;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi2;
SPI_HandleTypeDef hspi4;
DMA_HandleTypeDef hdma_spi2_tx;
DMA_HandleTypeDef hdma_spi4_rx;
DMA_HandleTypeDef hdma_spi4_tx;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_tx;

/* USER CODE BEGIN PV */

#ifdef SET_OLED_SPI
	const char gradus = 0x1f;
#else
	const char gradus = '^';
#endif
const char *cr_lf = "\r\n";

static evt_t evt_fifo[MAX_FIFO_SIZE] = {msg_empty};
uint8_t rd_evt_adr = 0;
uint8_t wr_evt_adr = 0;
uint8_t wr_evt_err = 0;
uint8_t cnt_evt = 0;
uint8_t max_evt = 0;

volatile uint32_t tik = 0;
volatile time_t epoch = 1610786184;
uint8_t tZone = 2;
volatile uint8_t setDate = 0;
char rxData[MAX_TMP_SIZE] = {0};
char rxByte = '\0';
uint8_t rx_uk = 0;
uint16_t rxBytes = 0;
char stx[MAX_TMP_SIZE] = {0};
char tmp[MAX_UART_BUF] = {0};
char txData[MAX_UART_BUF] = {0};
volatile uint8_t txDoneFlag = 1;
volatile uint8_t ledValue = 0;
uint32_t next = 0;
uint32_t msBegin = 0, msCnt = 0;
const uint32_t msPeriod = _100ms;
//
int siCmd = 0;
uint32_t tx_icnt = 0, rx_icnt = 0;
//

int jtune = 0;//set output in single string
uint8_t outMode = cjsonMode;
uint8_t outDebug = 0;

//
#if defined(SET_OLED_SPI) || defined(SET_IPS)
	SPI_HandleTypeDef *portOLED = NULL;
	char line[MAX_TMP_SIZE] = {0};
	uint32_t spi_cnt;
	char devName[32] = {0};//" - STM32F411 -  ";
	uint32_t tmr_shift = 0;

	#ifdef SET_OLED_SPI
		uint8_t shiftLine = 8;
		uint8_t shiftStart = OLED_CMD_SHIFT_START; // activate shift
	#endif

#endif

#ifdef SET_BMx280
	I2C_HandleTypeDef *portBMP = NULL;
	uint8_t reg_id = 0;
	uint8_t data_rdx[DATA_LENGTH] = {0};
	size_t d_size = 6;
	bool bStat = false;
	bool bmxCalibr = false;
	char bmxName[16] = {0};
#endif

compas_data_t compData = {0.0, 0.0};
I2C_HandleTypeDef *portHMC = NULL;

ADC_HandleTypeDef *portADC = NULL;
volatile uint16_t adcValue = 0;
volatile float VccF = 0.0;
uint32_t iadc_cnt = 0;
uint8_t startADC = 1;
uint16_t VccBuf[MAX_VCC_BUF] = {0};
uint8_t VccValCounter = 0;

float CompBuf[MAX_COMP_BUF] = {0};
uint8_t CompValCounter = 0;

uint32_t one_sec = 0;
uint32_t seconds = 0;
volatile uint8_t devError = 0;
uint32_t tmr_out = 0;
uint32_t errStatCnt = 0;
uint32_t cikl_out = _5s;


#ifdef SET_MPU
	I2C_HandleTypeDef *portMPU = NULL;
	uint32_t cntMPU = 0;
	bool mpuPresent = false;
	uint8_t mpuStatus;
#endif


struct mallinfo mem_info;// = mallinfo();

#ifdef SET_IRED

	const one_key_t keyAll[MAX_IRED_KEY] = {
			{"irCH-",   0xe318261b},
			{"irCH",    0x00511dbb},
			{"irCH+",   0xee886d7f},
			{"irLEFT",  0x52a3d41f},
			{"irRIGHT", 0xd7e84b1b},
			{"irSP",    0x20fe4dbb},
			{"ir-",     0xf076c13b},
			{"ir+",     0xa3c8eddb},
			{"irEQ",    0xe5cfbd7f},
			{"ir100+",  0x97483bfb},
			{"ir200+",  0xf0c41643},
			{"ir0",     0xc101e57b},
			{"ir1",     0x9716be3f},
			{"ir2",     0x3d9ae3f7},
			{"ir3",     0x6182021b},
			{"ir4",     0x8c22657b},
			{"ir5",     0x488f3cbb},
			{"ir6",     0x0449e79f},
			{"ir7",     0x32c6fdf7},
			{"ir8",     0x1bc0157b},
			{"ir9",     0x3ec3fc1b}
	};

#endif


#ifdef SET_NET
	//#define HTTP_SOCKET     0
	//#define PORT_TCPS		9000
	//#define DATA_BUF_SIZE   2048

