salara1960/stm32f411/Src/main.c
	//uint8_t gDATABUF[DATA_BUF_SIZE];

	char localIP[32] = {0};
	char netChipID[16] = {0};
	int dhcpSOC = 0;
	int udpSOC = 1;
	uint8_t stat_dhcp = DHCP_STOPPED;
	volatile uint8_t ip_assigned = 0;
	volatile uint32_t net_cnt = 0;
	uint8_t udpAddr[4] = {101};
	uint16_t udpPort = 8004;
	char udpText[64] = {0};
	int mlen = 0;//sprintf(udpText, "Message from device=%s ip=%s\r\n", netChipID, localIP);

	wiz_NetInfo gWIZNETINFO = {
				.mac = {0x00, 0x08, 0xdc, 0x47, 0x47, 0x54},
				.ip = {192, 168, 0, 200},
				.sn = {255, 255, 255, 0},
				.gw = {192, 168, 0, 1},
				.dns = {0, 0, 0, 0},
				.dhcp = NETINFO_STATIC};

	//--------------------------------------------------------------------------
	void W5500_Reset()
	{
		HAL_GPIO_WritePin(NET_RST_GPIO_Port, NET_RST_Pin, GPIO_PIN_RESET);
		HAL_Delay(1);
		HAL_GPIO_WritePin(NET_RST_GPIO_Port, NET_RST_Pin, GPIO_PIN_SET);
		HAL_Delay(10);
	}
	//--------------------------------------------------------------------------
	void W5500_Select() { CS_NET_SELECT(); }
	void W5500_Unselect() { CS_NET_DESELECT(); }
	//--------------------------------------------------------------------------
	void W5500_ReadBuff(uint8_t* buff, uint16_t len)
	{
	    if (HAL_SPI_Receive(&hspi4, buff, len, HAL_MAX_DELAY) != HAL_OK) devError |= devNet;
	}
	//--------------------------------------------------------------------------
	void W5500_WriteBuff(uint8_t* buff, uint16_t len)
	{
	    if (HAL_SPI_Transmit(&hspi4, buff, len, HAL_MAX_DELAY) != HAL_OK) devError |= devNet;
	}
	//--------------------------------------------------------------------------
	uint8_t W5500_ReadByte()
	{
	    uint8_t byte;
	    if (HAL_SPI_Receive(&hspi4, &byte, sizeof(uint8_t), HAL_MAX_DELAY) != HAL_OK) devError |= devNet;
	    return byte;
	}
	//--------------------------------------------------------------------------
	void W5500_WriteByte(uint8_t byte)
	{
		if (HAL_SPI_Transmit(&hspi4, &byte, sizeof(uint8_t), HAL_MAX_DELAY) != HAL_OK) devError |= devNet;
	}
	//--------------------------------------------------------------------------
	void Callback_IPAssigned() {
	    //UART_Printf("Callback: IP assigned! Leased time: %d sec\r\n", getDHCPLeasetime());
		getIPfromDHCP(gWIZNETINFO.ip);
		getGWfromDHCP(gWIZNETINFO.gw);
		getSNfromDHCP(gWIZNETINFO.sn);
		sprintf(localIP, "%d.%d.%d.%d", gWIZNETINFO.ip[0], gWIZNETINFO.ip[1], gWIZNETINFO.ip[2], gWIZNETINFO.ip[3]);
		memcpy(udpAddr, gWIZNETINFO.ip, 3);
	    ip_assigned = 1;
	}
	//--------------------------------------------------------------------------
	void Callback_IPConflict() {
	    //UART_Printf("Callback: IP conflict!\r\n");
		devError |= devNet;
	}
	//--------------------------------------------------------------------------
#endif

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM2_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI4_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM4_Init(void);
static void MX_SPI2_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

//-------------------------------------------------------------------------------------------
void led_OnOff()
{
	HAL_GPIO_TogglePin(tLED_GPIO_Port, tLED_Pin);
}
//-------------------------------------------------------------------------------------------
uint32_t getTimer(uint32_t t)
{
	return (tik + t);
}
int chkTimer(uint32_t t)
{
	return (tik >= t ? 1 : 0);
}
//-------------------------------------------------------------------------------------------
void setSec(uint32_t ep)
{
	//HAL_NVIC_DisableIRQ(TIM2_IRQn);
		seconds = ep;
	//HAL_NVIC_EnableIRQ(TIM2_IRQn);
}
//-------------------------------------------------------------------------------------------
uint32_t getSec()
{
	return seconds;
}
//-------------------------------------------------------------------------------------------
void putMsg(evt_t evt)
{
	HAL_NVIC_DisableIRQ(TIM2_IRQn);
	HAL_NVIC_DisableIRQ(USART1_IRQn);
	HAL_NVIC_DisableIRQ(ADC_IRQn);
#ifndef SET_COMPAS_BLOCK
	HAL_NVIC_DisableIRQ(I2C1_EV_IRQn);
#endif

	if (cnt_evt >= MAX_FIFO_SIZE) {
		wr_evt_err++;
	} else {
		evt_fifo[wr_evt_adr] = evt;
		cnt_evt++;
		if (wr_evt_adr < (MAX_FIFO_SIZE - 1) ) {
			wr_evt_adr++;
		} else  {
			wr_evt_adr = 0;
		}
		wr_evt_err = 0;
		if (cnt_evt > max_evt) max_evt = cnt_evt;
	}

	if (wr_evt_err) devError |= devFifo;
		       else devError &= ~devFifo;

#ifndef SET_COMPAS_BLOCK
	HAL_NVIC_EnableIRQ(I2C1_EV_IRQn);
#endif
	HAL_NVIC_EnableIRQ(ADC_IRQn);
	HAL_NVIC_EnableIRQ(USART1_IRQn);
	HAL_NVIC_EnableIRQ(TIM2_IRQn);
}
//-------------------------------------------------------------------------------------------
evt_t getMsg()
{
evt_t ret = msg_empty;

	HAL_NVIC_DisableIRQ(TIM2_IRQn);
	HAL_NVIC_DisableIRQ(USART1_IRQn);
	HAL_NVIC_DisableIRQ(ADC_IRQn);
#ifndef SET_COMPAS_BLOCK
	HAL_NVIC_DisableIRQ(I2C1_EV_IRQn);
#endif

	if (cnt_evt) {
		ret = evt_fifo[rd_evt_adr];
		if (cnt_evt) cnt_evt--;
		if (rd_evt_adr < (MAX_FIFO_SIZE - 1) ) {
			rd_evt_adr++;
		} else {
			rd_evt_adr = 0;
		}
	}

#ifndef SET_COMPAS_BLOCK
	HAL_NVIC_EnableIRQ(I2C1_EV_IRQn);
#endif
	HAL_NVIC_EnableIRQ(ADC_IRQn);
	HAL_NVIC_EnableIRQ(USART1_IRQn);
	HAL_NVIC_EnableIRQ(TIM2_IRQn);

	return ret;
}
//-------------------------------------------------------------------------------------------
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */

  /* USER CODE BEGIN Callback 1 */
	if (htim->Instance == TIM2) {//1ms period
		tik++;
		if (!(tik % (_10ms))) putMsg(msg_10ms);
		//
		one_sec++;
		if (one_sec >= _1s) {
			one_sec = 0;
			seconds++;
			putMsg(msg_sec);
		}
		//
	} else if (htim->Instance == TIM3) {
		//PWM pinA5
	}
#ifdef SET_IRED
	else if (htim->Instance == TIM4) {
		uint8_t irdata = RECIV_PIN; // пин для приёма
		irparams.timer++;  // One more 50uS tick
		if (irparams.rawlen >= RAWBUF) irparams.rcvstate = STATE_OVERFLOW;  // Buffer overflow

		switch(irparams.rcvstate) {
			case STATE_IDLE: // In the middle of a gap
				if (irdata == MARK) {
					if (irparams.timer < GAP_TICKS) { // Not big enough to be a gap.
						irparams.timer = 0;
					} else {
						// Gap just ended; Record duration; Start recording transmission
						irparams.overflow = 0;
						irparams.rawlen  = 0;
						irparams.rawbuf[irparams.rawlen++] = irparams.timer;
						irparams.timer = 0;
						irparams.rcvstate = STATE_MARK;
					}
				}
			break;
			case STATE_MARK:  // Timing Mark
				if (irdata == SPACE) {// Mark ended; Record time
					irparams.rawbuf[irparams.rawlen++] = irparams.timer;
					irparams.timer = 0;
					irparams.rcvstate = STATE_SPACE;
				}
			break;
			case STATE_SPACE:  // Timing Space
				if (irdata == MARK) {// Space just ended; Record time
					irparams.rawbuf[irparams.rawlen++] = irparams.timer;
					irparams.timer = 0;
					irparams.rcvstate = STATE_MARK;
				} else if (irparams.timer > GAP_TICKS) {// Space
					irparams.rcvstate = STATE_STOP;
				}
			break;
			case STATE_STOP:  // Waiting; Measuring Gap
			 	if (irdata == MARK) irparams.timer = 0;  // Reset gap timer
			break;
			case STATE_OVERFLOW:  // Flag up a read overflow; Stop the State Machine
				irparams.overflow = 1;
				irparams.rcvstate = STATE_STOP;
			break;
		}
	}
#endif
  /* USER CODE END Callback 1 */
}
//----------------------------------------------------------------------------------------
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{

