salara1960/stm32f411/Src/main.c
switch (outMode) {

#ifdef SET_cJSON
	case cjsonMode:
	{
		cJSON *obj = cJSON_CreateObject();
		if (obj) {
			char dt[32] = {0};
			sec_to_str_time(dt);
			cJSON_AddItemToObject(obj, "time", cJSON_CreateString(dt));
			cJSON_AddItemToObject(obj, "ms", cJSON_CreateNumber(tik));
			cJSON *arr1 = cJSON_CreateArray();
			if (arr1) {
				cJSON_AddItemToArray(arr1, cJSON_CreateNumber((int)cnt_evt));
				cJSON_AddItemToArray(arr1, cJSON_CreateNumber((int)max_evt));
				cJSON_AddItemToObject(obj, "fifo", arr1);
			} else devError |= devMem;
			cJSON_AddItemToObject(obj, "devError", cJSON_CreateNumber(devError));
			cJSON_AddItemToObject(obj, "volt", cJSON_CreateNumber(VccF));
			//
#ifdef SET_BMx280
			cJSON *sens1 = cJSON_CreateObject();
			if (sens1) {
				cJSON_AddItemToObject(sens1, "pres", cJSON_CreateNumber(sensors.bmx_pres));
				cJSON_AddItemToObject(sens1, "temp", cJSON_CreateNumber(sensors.bmx_temp));
				if (reg_id == BME280_SENSOR) cJSON_AddItemToObject(sens1, "humi", cJSON_CreateNumber(sensors.bmx_humi));
				cJSON_AddItemToObject(obj, bmxName, sens1);
			} else devError |= devMem;
#endif
			//
			cJSON *sens2 = cJSON_CreateObject();
			if (sens2) {
				cJSON_AddItemToObject(sens2, "azimut", cJSON_CreateNumber(compData.angleHMC));
				cJSON_AddItemToObject(sens2, "temp2", cJSON_CreateNumber(compData.tempHMC));
				cJSON_AddItemToObject(obj, "QMC5883L", sens2);
			} else devError |= devMem;
			//
			cJSON *sens3 = cJSON_CreateObject();
			if (sens3) {
				cJSON_AddItemToObject(sens3, "stat", cJSON_CreateNumber(mpuStatus));
				cJSON_AddItemToObject(sens3, "temp3", cJSON_CreateNumber(mpu_data.TEMP));
				cJSON *arr2 = cJSON_CreateArray();
				if (arr2) {
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.xACCEL));
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.yACCEL));
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.zACCEL));
					cJSON_AddItemToObject(sens3, "accel", arr2);
				} else devError |= devMem;
				cJSON *arr3 = cJSON_CreateArray();
				if (arr3) {
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.xGYRO));
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.yGYRO));
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.zGYRO));
					cJSON_AddItemToObject(sens3, "gyro", arr3);
				} else devError |= devMem;
				cJSON_AddItemToObject(obj, "MPU6050", sens3);
			} else devError |= devMem;
			//
			char *st = cJSON_PrintBuffered(obj, sizeof(tmp) - 1, jtune);
			if (st) {
				strcpy(tmp, st);
				strcat(tmp, ">");
				free(st);
			}

			cJSON_Delete(obj);

		} else devError |= devMem;
	}
	break;
#endif

	case jsonMode:
	{
		char dt[32] = {0};
		sec_to_str_time(dt);
		if (jtune) {
			sprintf(tmp, "{%s  \"time\": \"%s\",%s  \"ms\": %lu,%s  \"fifo\": [%u,%u]",
					cr_lf, dt, cr_lf, tik, cr_lf, cnt_evt, max_evt);
			sprintf(tmp+strlen(tmp), ",%s  \"devError\": %X", cr_lf, devError);
			sprintf(tmp+strlen(tmp), ",%s  \"volt\": %.3f", cr_lf, VccF);
#ifdef SET_BMx280
			sprintf(tmp+strlen(tmp), ",%s  \"%s\": {%s    \"pres\": %.2f,%s    \"temp\": %.2f",
					cr_lf, bmxName, cr_lf, sensors.bmx_pres, cr_lf, sensors.bmx_temp);
			if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), ",%s    \"humi\": %.2f", cr_lf, sensors.bmx_humi);
			sprintf(tmp+strlen(tmp), "%s  }", cr_lf);
#endif
			sprintf(tmp+strlen(tmp), ",%s  \"QMC5883L\": {%s    \"azimut\": %.2f,%s    \"temp2\": %.2f%s  }" ,
					cr_lf, cr_lf, compData.angleHMC, cr_lf, compData.tempHMC, cr_lf);
#ifdef SET_MPU
			sprintf(tmp+strlen(tmp), ",%s  \"MPU6050\": {%s    \"stat\": %X,%s    \"temp3\": %.2f,%s    \"accel\": [%d,%d,%d],%s    \"gyro\": [%d,%d,%d]%s  }%s",
							cr_lf, cr_lf,
							mpuStatus, cr_lf,
							mpu_data.TEMP, cr_lf,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL, cr_lf,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO, cr_lf, cr_lf);
#endif
		} else {
			sprintf(tmp, "{\"time\": \"%s\",\"ms\": %lu,\"fifo\": [%u,%u]", dt, tik, cnt_evt, max_evt);
			sprintf(tmp+strlen(tmp), ",\"devError\": %X", devError);
			sprintf(tmp+strlen(tmp), ",\"volt\": %.3f", VccF);
#ifdef SET_BMx280
			sprintf(tmp+strlen(tmp), ",\"%s\": {\"press\": %.2f,\"temp\": %.2f",
					bmxName, sensors.bmx_pres, sensors.bmx_temp);
			if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), ",\"humi\": %.2f", sensors.bmx_humi);
			strcat(tmp, "}");
#endif
			sprintf(tmp+strlen(tmp), ",\"QMC5883L\": {\"azimut\": %.2f,\"temp2\": %.2f}", compData.angleHMC, compData.tempHMC);
#ifdef SET_MPU
			sprintf(tmp+strlen(tmp), ",\"MPU6050\": {\"stat\": %X,\"temp3\": %.2f,\"accel\": [%d,%d,%d],\"gyro\": [%d,%d,%d]}",
							mpuStatus,
							mpu_data.TEMP,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO);
#endif

		}
		strcat(tmp, "}>");
	}
	break;

	default : {// textMode

		sprintf(tmp, " | ms=%lu fifo:%u/%u", tik, cnt_evt, max_evt);
		sprintf(tmp+strlen(tmp), " devError=%X", devError);
		sprintf(tmp+strlen(tmp), " | Vcc=%.3f", VccF);
#ifdef SET_BMx280
		sprintf(tmp+strlen(tmp)," | %s: pres=%.2f temp=%.2f",
								bmxName, sensors.bmx_pres, sensors.bmx_temp);
		if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), " humi=%.2f", sensors.bmx_humi);
#endif
		//compas_stat_t *cStat = (compas_stat_t *)confRegHmc;
		sprintf(tmp+strlen(tmp)," | QMC5883L: azimut=%.2f temp2=%.2f",
			    			compData.angleHMC,
							compData.tempHMC);
#ifdef SET_MPU
		sprintf(tmp+strlen(tmp)," | MPU6050: stat=%X temp3=%.2f accel=%d,%d,%d gyro=%d,%d,%d",
							mpuStatus,
							mpu_data.TEMP,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO);
#endif

	}
}

	if (outDebug) {
		mem_info = mallinfo();
		sprintf(tmp+strlen(tmp), "\r\n(noused=%d #freeChunk=%d #freeBlk=%d #mapReg=%d busy=%d max_busy=%d #freedBlk=%d used=%d free=%d top=%d)",
			mem_info.arena,// Non-mmapped space allocated (bytes)
			mem_info.ordblks,// Number of free chunks
			mem_info.smblks,// Number of free fastbin blocks
			mem_info.hblks,// Number of mmapped regions
			mem_info.hblkhd,// Space allocated in mmapped regions (bytes)
			mem_info.usmblks,// Maximum total allocated space (bytes)
			mem_info.fsmblks,// Space in freed fastbin blocks (bytes)
			mem_info.uordblks,// Total allocated space (bytes)
			mem_info.fordblks,// Total free space (bytes)
			mem_info.keepcost);// Top-most, releasable space (bytes)
	}

	return &tmp[0];
}
//-------------------------------------------------------------------------------------------

