salara1960/stm32f411/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RTC_Init();
  MX_TIM2_Init();
  MX_USART1_UART_Init();
  MX_I2C1_Init();
  MX_SPI4_Init();
  MX_ADC1_Init();
  MX_TIM4_Init();
  MX_SPI2_Init();
  /* USER CODE BEGIN 2 */


#if defined(SET_OLED_SPI) || defined(SET_IPS)
    sprintf(devName, "Speed:%lu", huart1.Init.BaudRate);
#endif

  	/* start timer1 + interrupt
	HAL_TIM_Base_Start(&htim2);
	HAL_TIM_Base_Start_IT(&htim2);*/
    //"start" rx_interrupt
	HAL_UART_Receive_IT(&huart1, (uint8_t *)&rxByte, 1);


	char *uk = NULL, *uke = NULL;
	evt_t evt;
	uint32_t schMS = 0;
	uint8_t setRTC = 0;

	ON_ERR_LED();//!!!!!!!!!!!!!!!!!!!!!
	STROB_UP();//!!!!!!!!!!!!!!!!!!!!!

#if defined(SET_OLED_SPI) || defined(SET_IPS)
	portOLED = &hspi2;
#endif
#if defined(SET_OLED_SPI)
    spi_ssd1306_Reset();
    //spi_ssd1306_on(1);//screen ON
    spi_ssd1306_init();//screen INIT
    spi_ssd1306_pattern();//set any params for screen
    //spi_ssd1306_invert();
    spi_ssd1306_clear();//clear screen

    int8_t len8 = 0;
    shiftLine = 8;
    shiftStart = OLED_CMD_SHIFT_STOP;//ART; // activate shift
//    spi_ssd1306_text_xy(devName, 1, shiftLine);
    //putMsg(msg_shiftEvent);

    //uint8_t sfst = 1;
#elif defined(SET_IPS)

    ST7789_Reset();
    ST7789_Init();

    FontDef fntKey = Font_16x26;
    FontDef tFont = Font_11x18;

    //uint8_t on_ips = 0;
    //ipsOn(on_ips);

    ST7789_Fill(0, 0, ST7789_WIDTH - 1, fntKey.height, WHITE);
    ST7789_Fill(0, ST7789_WIDTH - fntKey.height, ST7789_WIDTH - 1, ST7789_HEIGHT - 1, YELLOW);

#endif


#ifdef SET_BMx280
    portBMP = &hi2c1;

    i2c_reset_bmx280(&reg_id);
    if (reg_id == BME280_SENSOR) {
    	d_size = 8;
    	strcpy(bmxName, bme280s);
    } else {
    	d_size = 6;
    	if (reg_id == BMP280_SENSOR) strcpy(bmxName, bmp280s); else strcpy(bmxName, bmx280s);
    }

    //bmxCalibr = bmx280_readCalibrationData(reg_id);

#endif

#ifdef SET_MPU
    portMPU = &hi2c1;
    if (mpuID() == HAL_OK) {
    	if (mpuInit() == HAL_OK) {
    		mpuPresent = true;
    		mpuDisableInterrupts();
    	}
    }
#endif


#ifdef SET_IRED
    HAL_GPIO_WritePin(irLED_GPIO_Port, irLED_Pin, GPIO_PIN_SET);
	uint32_t tmr_ired = 0;
	enIntIRED();
#endif


#ifdef SET_NET

	//reset device
	W5500_Reset();

	reg_wizchip_cs_cbfunc(W5500_Select, W5500_Unselect);
	reg_wizchip_spi_cbfunc(W5500_ReadByte, W5500_WriteByte);
	reg_wizchip_spiburst_cbfunc(W5500_ReadBuff, W5500_WriteBuff);

	uint8_t tx_buff_sizes[] = {2, 2, 2, 2, 2, 2, 2, 2};
	uint8_t rx_buff_sizes[] = {2, 2, 2, 2, 2, 2, 2, 2};

	if (wizchip_init(tx_buff_sizes, rx_buff_sizes) != 0) {
		devError |= devNet;
	} else {
		memset(netChipID, 0, sizeof(netChipID));
		ctlwizchip(CW_GET_ID, (void *)&netChipID[0]);
		if (gWIZNETINFO.dhcp == NETINFO_STATIC) {//STATIC ADDR
			ctlnetwork(CN_SET_NETINFO, (void *)&gWIZNETINFO);
			ctlnetwork(CN_GET_NETINFO, (void *)&gWIZNETINFO);
			sprintf(localIP, "%d.%d.%d.%d", gWIZNETINFO.ip[0], gWIZNETINFO.ip[1], gWIZNETINFO.ip[2], gWIZNETINFO.ip[3]);

			ip_assigned = 1;
			memcpy(&udpAddr[0], (uint8_t *)&gWIZNETINFO.ip[0], 3);
			udpAddr[3] = 255;
		} else {//ADDR from DHCP
			ip_assigned = 0;
			uint8_t dhcpBuf[1024];

			setSHAR(gWIZNETINFO.mac);
			DHCP_init(dhcpSOC, dhcpBuf);
			reg_dhcp_cbfunc(Callback_IPAssigned, Callback_IPAssigned, Callback_IPConflict);

			if (!ip_assigned) {
				if (!((stat_dhcp == DHCP_IP_ASSIGN) ||
						(stat_dhcp == DHCP_IP_CHANGED) ||
							(stat_dhcp == DHCP_FAILED) ||
								(stat_dhcp == DHCP_IP_LEASED))) stat_dhcp = DHCP_run();
			}
		}
	}

	uint8_t netFlag = SF_IO_NONBLOCK | SF_BROAD_BLOCK;//SF_UNI_BLOCK;//SF_MULTI_BLOCK;//SF_BROAD_BLOCK;//SF_IO_NONBLOCK
	int32_t cnt_udp = 0;
	uint8_t en_udp = 1;
	int32_t stat_udp;
	int8_t usoc = -1;
	const uint8_t udp_sec_period = 5;
	uint8_t udp_sec = udp_sec_period;
	uint32_t udp_pack_num = 0;

#endif


    //---------------------------------------
	//"start" ADC interrupt
	portADC = &hadc1;
	if (startADC) HAL_ADC_Start_IT(portADC);
    //
    // start timer1 + interrupt
    HAL_TIM_Base_Start(&htim2);
    HAL_TIM_Base_Start_IT(&htim2);
    //
    //---------------------------------------

	portHMC = &hi2c1;
	xyz = (xyz_t *)&magBuf[0];
//	COPMAS_Reset();
	COPMAS_Init();
	cStat = COPMAS_ReadStat();
#ifdef SET_COMPAS_BLOCK
    siCmd = msg_empty;
    evt = msg_startCompas;
#else
    siCmd = msg_startCompas;
    evt = msg_i2c;
    next = getTimer(_100ms);
#endif

    tmr_out = getTimer(_1s);
    next = getTimer(0);
    errStatCnt = 0;

    putMsg(evt);


#ifdef SET_NET
    if (usoc < 0) putMsg(msg_mkUdp);
#endif


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1)  {

#ifdef SET_IRED
		if (!tmr_ired) {
			if (decodeIRED(&results)) {
				tmr_ired = getTimer(_300ms);
				IRRED_LED();
				int8_t kid = -1;
				for (int8_t i = 0; i < MAX_IRED_KEY; i++) {
					if (results.value == keyAll[i].code) {
						kid = i;
						break;
					}
				}
#if defined(SET_OLED_SPI)
				int8_t k;
				if (kid == -1) k = sprintf(line, " CODE:%08lX ", results.value);
				          else k = sprintf(line, " irKEY: %s ", keyAll[kid].name);
				if (k < len8) spi_ssd1306_clear_line(8);
				len8 = k;
				spi_ssd1306_text_xy(line, 1, 8);
#elif defined(SET_IPS)
				if (kid == -1) sprintf(line, "CODE:%08lX", results.value);
				          else sprintf(line, "irKEY: %s", keyAll[kid].name);
				//ST7789_Fill(0, ST7789_WIDTH - fntKey.height, ST7789_WIDTH - 1, ST7789_HEIGHT - 1, YELLOW);
				ST7789_WriteString(0, ST7789_WIDTH - fntKey.height, mkLineCenter(line, ST7789_WIDTH / fntKey.width), fntKey, MAGENTA, YELLOW);
#endif
				if (kid != -1) {
					switch (kid) {
						case key_100: jtune = 1; break;
						case key_200: jtune = 0; break;

						case key_minus:
							if (cikl_out >= 200) cikl_out -= 100;
						break;
						case key_plus:
							if (cikl_out < 30000) cikl_out += 100;
						break;

						case key_0: outMode = textMode;  break;
						case key_1: outMode = jsonMode;  break;
						case key_2: outMode = cjsonMode; break;

						case key_3: outDebug = 1; break;//dbg_on
						case key_4: outDebug = 0; break;//dbg_off

